000100 IDENTIFICATION DIVISION. 
000200 PROGRAM-ID. LOOP.
000300 ENVIRONMENT DIVISION. 
000400 DATA DIVISION.
       WORKING-STORAGE SECTION.
       01   COUNTER PIC 99.
       01   TOTAL PIC 999.
000500 PROCEDURE DIVISION. 
000600* Compute sum from 0 to 10
000700 PROGRAM-BEGIN.
000800 MOVE 0 TO COUNTER. 
000900 PERFORM UNTIL COUNTER = 10
001000  COMPUTE TOTAL = COUNTER + TOTAL
001100  ADD 1 TO COUNTER GIVING COUNTER
001200 END-PERFORM.
001300 DISPLAY TOTAL.
001400 PROGRAM-DONE. 
001500 STOP RUN.
